; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	spectrograph4 - mode
	image1 - mode
	infrared2 - mode
	image3 - mode
	spectrograph0 - mode
	Star2 - direction
	Star4 - direction
	Star5 - direction
	GroundStation7 - direction
	Star9 - direction
	Star10 - direction
	GroundStation11 - direction
	Star14 - direction
	GroundStation13 - direction
	Star1 - direction
	GroundStation12 - direction
	Star6 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	GroundStation8 - direction
	Star15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Phenomenon19 - direction
	Planet20 - direction
	Planet21 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 infrared2)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 GroundStation13)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet20)
	(supports instrument1 spectrograph4)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation12)
	(calibration_target instrument1 Star1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation11)
	(supports instrument2 spectrograph4)
	(supports instrument2 infrared2)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation8)
)
(:goal (and
	(pointing satellite0 GroundStation7)
	(pointing satellite1 Star2)
	(have_image Star15 spectrograph0)
	(have_image Star16 image3)
	(have_image Phenomenon17 infrared2)
	(have_image Planet18 image1)
	(have_image Phenomenon19 image1)
	(have_image Planet20 image1)
	(have_image Planet21 infrared2)
))

)

; plan
1. (turn_to satellite1 groundstation12 groundstation11)
   deleted: (pointing satellite1 groundstation11)
   added: (pointing satellite1 groundstation12)
   goals met: 0 of 9
2. (turn_to satellite0 groundstation13 planet20)
   deleted: (pointing satellite0 planet20)
   added: (pointing satellite0 groundstation13)
   goals met: 0 of 9
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
4. (calibrate satellite0 instrument0 groundstation13)
   added: (calibrated instrument0)
   goals met: 0 of 9
5. (turn_to satellite0 phenomenon19 groundstation13)
   deleted: (pointing satellite0 groundstation13)
   added: (pointing satellite0 phenomenon19)
   goals met: 0 of 9
6. (take_image satellite0 phenomenon19 instrument0 image1)
   added: (have_image phenomenon19 image1)
   goals met: 1 of 9
7. (turn_to satellite0 phenomenon17 phenomenon19)
   deleted: (pointing satellite0 phenomenon19)
   added: (pointing satellite0 phenomenon17)
   goals met: 1 of 9
8. (take_image satellite0 phenomenon17 instrument0 infrared2)
   added: (have_image phenomenon17 infrared2)
   goals met: 2 of 9
9. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 9
10. (calibrate satellite1 instrument1 groundstation12)
   added: (calibrated instrument1)
   goals met: 2 of 9
11. (turn_to satellite0 planet18 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet18)
   goals met: 2 of 9
12. (take_image satellite0 planet18 instrument0 image1)
   added: (have_image planet18 image1)
   goals met: 3 of 9
13. (turn_to satellite0 planet20 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 planet20)
   goals met: 3 of 9
14. (take_image satellite0 planet20 instrument0 image1)
   added: (have_image planet20 image1)
   goals met: 4 of 9
15. (turn_to satellite0 planet21 planet20)
   deleted: (pointing satellite0 planet20)
   added: (pointing satellite0 planet21)
   goals met: 4 of 9
16. (take_image satellite0 planet21 instrument0 infrared2)
   added: (have_image planet21 infrared2)
   goals met: 5 of 9
17. (turn_to satellite0 star16 planet21)
   deleted: (pointing satellite0 planet21)
   added: (pointing satellite0 star16)
   goals met: 5 of 9
18. (take_image satellite0 star16 instrument0 image3)
   added: (have_image star16 image3)
   goals met: 6 of 9
19. (turn_to satellite0 groundstation7 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 groundstation7)
   goals met: 7 of 9
20. (turn_to satellite1 star15 groundstation12)
   deleted: (pointing satellite1 groundstation12)
   added: (pointing satellite1 star15)
   goals met: 7 of 9
21. (take_image satellite1 star15 instrument1 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 8 of 9
22. (turn_to satellite1 star2 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star2)
   goals met: 9 of 9
